Revit 2027 API
RelinquishOptions.ViewWorksets Property
 True means all view worksets owned by the current user should be relinquished. False means none of these are relinquished.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ViewWorksets { get; set; }
Public Property ViewWorksets As Boolean
	Get
	Set
public:
property bool ViewWorksets {
	bool get ();
	void set (bool value);
}
member ViewWorksets : bool with get, set
Property Value
Boolean
See Also
Reference
RelinquishOptions Class
Autodesk.Revit.DB Namespace